VGG(
  (features): Sequential(
    (convbn0): tdLayer(
      (layer): SeqToANNContainer(
        (module): Conv2d(3, 64, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
      )
      (bn): tdBatchNorm(
        (bn): BatchNorm2d(64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        (seqbn): SeqToANNContainer(
          (module): BatchNorm2d(64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        )
      )
    )
    (relu0): LIFSpike()
    (convbn1): tdLayer(
      (layer): SeqToANNContainer(
        (module): ReScaWConv()
      )
      (bn): tdBatchNorm(
        (bn): BatchNorm2d(64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        (seqbn): SeqToANNContainer(
          (module): BatchNorm2d(64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        )
      )
    )
    (relu1): LIFSpike()
    (pool2): SeqToANNContainer(
      (module): MaxPool2d(kernel_size=2, stride=2, padding=0, dilation=1, ceil_mode=False)
    )
    (convbn3): tdLayer(
      (layer): SeqToANNContainer(
        (module): ReScaWConv()
      )
      (bn): tdBatchNorm(
        (bn): BatchNorm2d(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        (seqbn): SeqToANNContainer(
          (module): BatchNorm2d(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        )
      )
    )
    (relu3): LIFSpike()
    (convbn4): tdLayer(
      (layer): SeqToANNContainer(
        (module): ReScaWConv()
      )
      (bn): tdBatchNorm(
        (bn): BatchNorm2d(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        (seqbn): SeqToANNContainer(
          (module): BatchNorm2d(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        )
      )
    )
    (relu4): LIFSpike()
    (pool5): SeqToANNContainer(
      (module): MaxPool2d(kernel_size=2, stride=2, padding=0, dilation=1, ceil_mode=False)
    )
    (convbn6): tdLayer(
      (layer): SeqToANNContainer(
        (module): ReScaWConv()
      )
      (bn): tdBatchNorm(
        (bn): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        (seqbn): SeqToANNContainer(
          (module): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        )
      )
    )
    (relu6): LIFSpike()
    (convbn7): tdLayer(
      (layer): SeqToANNContainer(
        (module): ReScaWConv()
      )
      (bn): tdBatchNorm(
        (bn): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        (seqbn): SeqToANNContainer(
          (module): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        )
      )
    )
    (relu7): LIFSpike()
    (convbn8): tdLayer(
      (layer): SeqToANNContainer(
        (module): ReScaWConv()
      )
      (bn): tdBatchNorm(
        (bn): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        (seqbn): SeqToANNContainer(
          (module): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        )
      )
    )
    (relu8): LIFSpike()
    (pool9): SeqToANNContainer(
      (module): MaxPool2d(kernel_size=2, stride=2, padding=0, dilation=1, ceil_mode=False)
    )
    (convbn10): tdLayer(
      (layer): SeqToANNContainer(
        (module): ReScaWConv()
      )
      (bn): tdBatchNorm(
        (bn): BatchNorm2d(512, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        (seqbn): SeqToANNContainer(
          (module): BatchNorm2d(512, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        )
      )
    )
    (relu10): LIFSpike()
    (convbn11): tdLayer(
      (layer): SeqToANNContainer(
        (module): ReScaWConv()
      )
      (bn): tdBatchNorm(
        (bn): BatchNorm2d(512, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        (seqbn): SeqToANNContainer(
          (module): BatchNorm2d(512, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        )
      )
    )
    (relu11): LIFSpike()
    (convbn12): tdLayer(
      (layer): SeqToANNContainer(
        (module): ReScaWConv()
      )
      (bn): tdBatchNorm(
        (bn): BatchNorm2d(512, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        (seqbn): SeqToANNContainer(
          (module): BatchNorm2d(512, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        )
      )
    )
    (relu12): LIFSpike()
    (pool13): SeqToANNContainer(
      (module): MaxPool2d(kernel_size=2, stride=2, padding=0, dilation=1, ceil_mode=False)
    )
    (convbn14): tdLayer(
      (layer): SeqToANNContainer(
        (module): ReScaWConv()
      )
      (bn): tdBatchNorm(
        (bn): BatchNorm2d(512, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        (seqbn): SeqToANNContainer(
          (module): BatchNorm2d(512, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        )
      )
    )
    (relu14): LIFSpike()
    (convbn15): tdLayer(
      (layer): SeqToANNContainer(
        (module): ReScaWConv()
      )
      (bn): tdBatchNorm(
        (bn): BatchNorm2d(512, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        (seqbn): SeqToANNContainer(
          (module): BatchNorm2d(512, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        )
      )
    )
    (relu15): LIFSpike()
    (convbn16): tdLayer(
      (layer): SeqToANNContainer(
        (module): ReScaWConv()
      )
      (bn): tdBatchNorm(
        (bn): BatchNorm2d(512, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        (seqbn): SeqToANNContainer(
          (module): BatchNorm2d(512, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        )
      )
    )
    (relu16): LIFSpike()
  )
  (avgpool): SeqToANNContainer(
    (module): AvgPool2d(kernel_size=2, stride=2, padding=0)
  )
  (classifier): Sequential(
    (linear1): SeqToANNContainer(
      (module): Linear(in_features=512, out_features=10, bias=True)
    )
  )
)

总参数数量: 29,432,842